; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image4 - mode
	image0 - mode
	image1 - mode
	thermograph2 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation5 - direction
	Star1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 image4)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph3)
	(supports instrument2 image4)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph3)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 image1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
)
(:goal (and
	(have_image Phenomenon6 image4)
	(have_image Planet7 thermograph2)
	(have_image Phenomenon8 spectrograph3)
	(have_image Phenomenon9 spectrograph3)
	(have_image Planet10 image1)
	(have_image Planet11 image0)
	(have_image Star12 image1)
	(have_image Planet13 image0)
	(have_image Phenomenon14 thermograph2)
	(have_image Star15 spectrograph3)
))

)

; plan
1. (turn_to satellite2 star1 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star1)
   goals met: 0 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite2 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite2 planet13 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet13)
   goals met: 0 of 10
5. (take_image satellite2 planet13 instrument5 image0)
   added: (have_image planet13 image0)
   goals met: 1 of 10
6. (turn_to satellite2 planet11 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet11)
   goals met: 1 of 10
7. (take_image satellite2 planet11 instrument5 image0)
   added: (have_image planet11 image0)
   goals met: 2 of 10
8. (turn_to satellite2 planet10 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet10)
   goals met: 2 of 10
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 10
10. (calibrate satellite1 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 2 of 10
11. (take_image satellite2 planet10 instrument5 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 10
12. (turn_to satellite1 phenomenon14 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 10
13. (take_image satellite1 phenomenon14 instrument2 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 4 of 10
14. (turn_to satellite1 phenomenon6 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon6)
   goals met: 4 of 10
15. (take_image satellite1 phenomenon6 instrument2 image4)
   added: (have_image phenomenon6 image4)
   goals met: 5 of 10
16. (turn_to satellite1 phenomenon8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon8)
   goals met: 5 of 10
17. (take_image satellite1 phenomenon8 instrument2 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 6 of 10
18. (turn_to satellite1 phenomenon9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 10
19. (take_image satellite1 phenomenon9 instrument2 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 7 of 10
20. (turn_to satellite1 planet7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet7)
   goals met: 7 of 10
21. (take_image satellite1 planet7 instrument2 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 8 of 10
22. (turn_to satellite1 star15 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star15)
   goals met: 8 of 10
23. (take_image satellite1 star15 instrument2 spectrograph3)
   added: (have_image star15 spectrograph3)
   goals met: 9 of 10
24. (turn_to satellite2 star12 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star12)
   goals met: 9 of 10
25. (take_image satellite2 star12 instrument5 image1)
   added: (have_image star12 image1)
   goals met: 10 of 10
